Revit 2026 API

# FamilyManagerParameter(Definition) Property

---

Obtains the parameter of this type with a given definition.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyParameter this[
	Definition definition
] { get; }
```
```vb
Public ReadOnly Property Parameter (
	definition As Definition
) As FamilyParameter
	Get
```
```cpp
public:
property FamilyParameter^ Parameter[Definition^ definition] {
	FamilyParameter^ get (Definition^ definition);
}
```
```fsharp
member Parameter : FamilyParameter with get
```

#### Parameters

definition Definition

#### Property Value

FamilyParameter

Returns  if the parameter is not found.

#### Reference

FamilyManager Class

Parameter Overload

Autodesk.Revit.DB Namespace